[
    {
      "course_id": "กช321",
      "course_name": "เศรษฐกิจพอเพียงและการพัฒนาที่ยั่งยืน",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "ศท021",
      "course_name": "สังคมศาสตร์ในชีวิตประจำวัน",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "ศท022",
      "course_name": "อารยธรรมโลก",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "ศท104",
      "course_name": "มนุษย์และสิ่งแวดล้อม",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "ศท302",
      "course_name": "สังคมและวัฒนธรรมไทย",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "ศศ101",
      "course_name": "เศรษฐศาสตร์เพื่อชีวิตประจำวันและการประกอบการ",
      "credit": "3  (3-0-6)"
    },
    {
      "course_id": " ศท011",
      "course_name": "มนุษย์กับความงามทางศิลปะ",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "ศท012",
      "course_name": "จิตวิทยากับพฤติกรรมมนุษย์",
      "credit": "3  (3-0-6)"
    },
    {
      "course_id": "ศท013",
      "course_name": "สุขภาพเพื่อการดำรงชีวิต",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "ศท180",
      "course_name": "ศิลปะกับความคิดสร้างสรรค์",
      "credit": "3 (1-4-4)"
    },
    {
      "course_id": "ศท304",
      "course_name": "ศาสตร์และศิลป์แห่งปัญญาชน",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "ศท305",
      "course_name": "ประวัติศาสตร์และพัฒนาการของล้านนา",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "ศท031",
      "course_name": "การใช้ภาษาไทย",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "ศท141",
      "course_name": "ภาษาอังกฤษพื้นฐาน 1",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "ศท142",
      "course_name": "ภาษาอังกฤษพื้นฐาน 2",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "ศท241",
      "course_name": "ภาษาอังกฤษเชิงวิทยาศาสตร์และเทคโนโลยี 1",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "ผษ101",
      "course_name": "เกษตรเพื่อชีวิต",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "พง100",
      "course_name": "พลังงานสำหรับชีวิตประจำวัน",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": " วท101",
      "course_name": "วิทยาศาสตร์เพื่อชีวิต",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "วท102",
      "course_name": "การพัฒนาวิทยาศาสตร์และเทคโนโลยี",
      "credit": "3 (2-3-5)"
    },
    {
      "course_id": "วอ101",
      "course_name": "วิศวกรรมเบื้องต้นในชีวิตประจำวัน",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "คพ111",
      "course_name": "วิทยาการคอมพิวเตอร์1",
      "credit": "3 (2-3-5)"
    },
    {
      "course_id": "คพ112",
      "course_name": "วิทยาการคอมพิวเตอร์ 2",
      "credit": "3 (2-3-5)"
    },
    {
      "course_id": "คพ121",
      "course_name": "ตรรกศาสตร์เชิงดิจิทัลและอุปกรณ์อัจฉริยะ",
      "credit": "3 (2-3-5)"
    },
    {
      "course_id": "คพ151",
      "course_name": "คณิตศาสตร์ดีสครีต",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "คพ252",
      "course_name": "คณิตศาสตร์สำหรับวิทยาการคอมพิวเตอร์",
      "credit": "3 (2-2-5)"
    },
    {
        "course_id": "คพ392",
        "course_name": "การเป็นผู้ประกอบการทางด้านคอมพิวเตอร์และนวัตกรรม",
        "credit": "3 (2-3-5)"
      },
    {
        "course_id": "คศ101",
        "course_name": "แคลคูลัส 1",
        "credit": "3  (3-0-6)"
    },
    {
        "course_id": "ศท242",
        "course_name": "ภาษาอังกฤษเชิงวิทยาศาสตร์และเทคโนโลยี 2",
        "credit": "3 (2-2-5)"
    },
    {
        "course_id": "สต301",
        "course_name": "หลักสถิติ",
        "credit": "3  (3-0-6)"
    },
    {
        "course_id": "ชว100",
        "course_name": "ชีววิทยาทั่วไป",
        "credit": "3 (2-3-5)"
    },{
        "course_id": "คพ117",
        "course_name": "หลักการเขียนโปรแกรมเชิงวัตถุ",
        "credit": "3 (2-3-5)"
    },
    {
        "course_id": "คพ213",
        "course_name": "การวิเคราะห์และออกแบบอัลกอริทึม",
        "credit": "3 (2-3-5)"
    },
    {
        "course_id": "คพ221",
        "course_name": "โครงสร้างข้อมูล",
        "credit": "3 (2-3-5)"
    },
    {
        "course_id": "คพ231",
        "course_name": "ระบบคอมพิวเตอร์และภาษาแอสเซมบลี",
        "credit": "3 (0-3-1)"
    },
    {
        "course_id": "คพ232",
        "course_name": "สถาปัตยกรรมคอมพิวเตอร์",
        "credit": "3 (2-3-5)"
    },
    {
        "course_id": "คพ241",
        "course_name": "ระบบฐานข้อมูล",
        "credit": "3 (2-3-5)"
    },
    {
        "course_id": "คพ313",
        "course_name": "การพัฒนาโปรแกรมประยุกต์บนเว็บ",
        "credit": "3 (2-3-5)"
    },
    {
        "course_id": "คพ343",
        "course_name": "การวิเคราะห์และออกแบบเชิงวัตถุ",
        "credit": "3 (2-3-5)"
    },
    {
        "course_id": "คพ347",
        "course_name": "วิศวกรรมซอฟต์แวร์",
        "credit": "3 (2-3-5)"
    },
    {
        "course_id": "คพ391",
        "course_name": "การบริหารโครงการคอมพิวเตอร์",
        "credit": "3 (1-0-2)"
    },
    {
        "course_id": "คพ492",
        "course_name": "สัมมนาวิชาการทางวิทยาการคอมพิวเตอร์",
        "credit": "3 (0-2-1)"
    },
    {
        "course_id": "วท497",
        "course_name": "สหกิจศึกษา",
        "credit": "3 (0-270-0)"
    },
    {
        "course_id": "วท498",
        "course_name": "การเรียนรู้อิสระ",
        "credit": "3 (0-270-0)"
    },
    {
        "course_id": "วท499",
        "course_name": "การศึกษา หรือการฝึกงาน หรือฝึกอบรมต่างประเทศ",
        "credit": "3 (0-270-0)"
    }, 
    {
      "course_id": "-",
      "course_name": "วิชาเอกเลือก วิชาที่ 1",
      "credit": "3 ( - - )"
    },
    {
      "course_id": "-",
      "course_name": "วิชาเอกเลือก วิชาที่ 2",
      "credit": "3 ( - - )"
    },
    {
      "course_id": "-",
      "course_name": "วิชาเอกเลือก วิชาที่ 3",
      "credit": "3 ( - - )"
    },
    {
      "course_id": "-",
      "course_name": "วิชาเอกเลือก วิชาที่ 4",
      "credit": "3 ( - - )"
    },
    {
      "course_id": "10300410",
      "course_name": "ความฉลาดรู้ด้านวิทยาศาสตร์สำหรับโลกสมัยใหม่",
      "credit": "3 (3-0-6)"
    },
    {
      "course_id": "10200504",
      "course_name": "การเป็นผู้ประกอบการ",
      "credit": "3 (2-2-5)"
    },
    {
      "course_id": "-",
      "course_name": "วิชาเอกเลือก วิชาที่ 5",
      "credit": "3 ( - - )"
    },
    {
      "course_id": "-",
      "course_name": "วิชาเอกเลือก วิชาที่ 6",
      "credit": "3 ( - - )"
    },
    {
      "course_id": "-",
      "course_name": "วิชาเอกเลือก วิชาที่ 7",
      "credit": "3 ( - - )"
    },
    {
      "course_id": "10300497",
      "course_name": "สหกิจศึกษา (*เลือกอย่างใดอย่างหนึ่ง)",
      "credit": "6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)"
    },
    {
      "course_id": "10300498",
      "course_name": "การเรียนรู้อิสระ (*เลือกอย่างใดอย่างหนึ่ง)",
      "credit": "6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)"
    },
    {
      "course_id": "10300499",
      "course_name": "การศึกษา / ฝึกงาน / ฝึกอบรมต่างประเทศ (*เลือกอย่างใดอย่างหนึ่ง)",
      "credit": "6 (ปฏิบัติไม่น้อยกว่า 16 สัปดาห์)"
    },
    {
      "course_id": null,
      "course_name": "วิชาเลือกเสรี วิชาที่ 1",
      "credit": "3 ( - - )"
    },
    {
      "course_id": null,
      "course_name": "วิชาเลือกเสรี วิชาที่ 2",
      "credit": "3 ( - - )"
    }
  ]